Revit 2027 API
PanelScheduleView.GetLoadClassificationName Method
 Gets the name of the Load Classification at the given row/column
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLoadClassificationName(
	int nRow,
	int nCol
)
Public Function GetLoadClassificationName (
	nRow As Integer,
	nCol As Integer
) As String
public:
String^ GetLoadClassificationName(
	int nRow,
	int nCol
)
member GetLoadClassificationName :
        nRow : int *
        nCol : int -> string
Parameters
nRow Int32
 Row Number of the Load Summary Section
nCol Int32
 Column number of Load Summary Section
Return Value
String
 The name of the Load Classification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace